In [9]:
import json
import sqlite3
import pandas as pd

with open("pokemon_moves.json") as f:
    moveset = json.load(f)

df_pokemon = pd.read_csv("pokemon.csv", index_col=0)
conn = sqlite3.connect("test_database.db")

In [10]:
c = conn.cursor()

In [11]:
c

In [39]:
df_pokemon.to_sql('stats', conn, if_exists='replace', index=0)
df_pokemon.head()

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\generic.py:2605: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [37]:
c.execute(
'''
SELECT 'Type 1' FROM stats
'''
)

In [25]:
df_backwards = pd.DataFrame(c.fetchall())
df_backwards.head()

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,0
1,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,0
2,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,0
3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,0
4,Charmander,Fire,None,309,39,52,43,60,50,65,1,0

In [35]:
data = c.execute(
    '''
    SELECT *
FROM stats''')
print(data.description)

(('Name', None, None, None, None, None, None), ('Type 1', None, None, None, None, None, None), ('Type 2', None, None, None, None, None, None), ('Total', None, None, None, None, None, None), ('HP', None, None, None, None, None, None), ('Attack', None, None, None, None, None, None), ('Defense', None, None, None, None, None, None), ('Sp. Atk', None, None, None, None, None, None), ('Sp. Def', None, None, None, None, None, None), ('Speed', None, None, None, None, None, None), ('Generation', None, None, None, None, None, None), ('Legendary', None, None, None, None, None, None))